results/res6_img8_4k/h200_disagg_32b_image8_4k_np64/test_sglang_multi_rates_1080p_20260522_230851/rate_0.5/results.txt
/opt/sglang/python/sglang/benchmark/datasets/image.py:51: UserWarning: High resolution (3840x2160) with 256 total images may take a long time. Consider reducing resolution or image count.
  return sample_image_requests(
benchmark_args=Namespace(backend='sglang-oai-chat', base_url='http://localhost:7001', host='0.0.0.0', port=None, ready_check_timeout_sec=60, dataset_name='image', dataset_path='', model='/mnt/weka/data/llm-d-models-pv/models--Qwen--Qwen3-VL-32B-Instruct-FP8', served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=256, random_range_ratio=0.0, image_count=8, image_resolution='4k', random_image_count=False, image_format='jpeg', image_content='random', request_rate=0.5, use_trace_timestamps=False, max_concurrency=None, output_file='/hongming/res6_img8_4k/h200_disagg_32b_image8_4k_np64/test_sglang_multi_rates_1080p_20260522_230851/rate_0.5/benchmark_output.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=0, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://localhost:7001/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang-oai-chat', base_url='http://localhost:7001', host='0.0.0.0', port=30000, ready_check_timeout_sec=60, dataset_name='image', dataset_path='', model='/mnt/weka/data/llm-d-models-pv/models--Qwen--Qwen3-VL-32B-Instruct-FP8', served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=256, random_range_ratio=0.0, image_count=8, image_resolution='4k', random_image_count=False, image_format='jpeg', image_content='random', request_rate=0.5, use_trace_timestamps=False, max_concurrency=None, output_file='/hongming/res6_img8_4k/h200_disagg_32b_image8_4k_np64/test_sglang_multi_rates_1080p_20260522_230851/rate_0.5/benchmark_output.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=0, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 2091902
#Output tokens: 4884
#Total images: 256
#Images per request: 8 (fixed)

Created 32 random jpeg images with average 66754606 bytes per request
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 32/32 [12:52<00:00, 24.14s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai-chat
Traffic request rate:                    0.5       
Max request concurrency:                 not set   
Successful requests:                     32        
Benchmark duration (s):                  772.51    
Total input tokens:                      2091902   
Total input text tokens:                 2430      
Total input vision tokens:               2089472   
Total generated tokens:                  4884      
Total generated tokens (retokenized):    4749      
Request throughput (req/s):              0.04      
Input token throughput (tok/s):          2707.93   
Output token throughput (tok/s):         6.32      
Peak output token throughput (tok/s):    210.00    
Peak concurrent requests:                32        
Total token throughput (tok/s):          2714.25   
Concurrency:                             24.36     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   588142.22 
Median E2E Latency (ms):                 598337.54 
P90 E2E Latency (ms):                    726247.36 
P99 E2E Latency (ms):                    736417.87 
---------------Time to First Token----------------
Mean TTFT (ms):                          432764.03 
Median TTFT (ms):                        440746.35 
P99 TTFT (ms):                           709206.89 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          1095.72   
Median TPOT (ms):                        1165.39   
P99 TPOT (ms):                           2527.78   
---------------Inter-Token Latency----------------
Mean ITL (ms):                           1050.40   
Median ITL (ms):                         55.86     
P95 ITL (ms):                            2152.03   
P99 ITL (ms):                            16183.56  
Max ITL (ms):                            185649.36 
==================================================